def main():
    """https://contest.yandex.ru/contest/52598/problems/
    A. Удаление дубликатов
    Марсоход берёт пробы грунта, определяет тип горных пород и записывает полученные данные в отсортированный массив. 
    Каждый тип горной породы обозначается целым числом. Массив отсортирован в порядке возрастания: значения идут от меньшего к большему. 
    В массиве могут быть дублирующиеся значения, ведь в разных пробах могут встречаться одни и те же горные породы.
    Ваша задача — написать программу, удаляющую дубликаты из этого массива: каждый элемент должен встречаться в массиве только один раз. 
    При этом относительный порядок элементов должен остаться прежним. Дублирующие значения нужно заменить на символ подчёркивания.
    После выполнения преобразований массив должен остаться такого же размера, как и был. В начале массива должны находиться уникальные элементы, 
    а после них — элементы, содержащие символ подчёркивания. Эти элементы должны быть строго в конце массива, не между числами.

    Формат ввода
    В первой строке записано целое число n — это длина массива, переданного во второй строке.
    Во второй строке записано n натуральных чисел, разделённых пробелами.

    Формат вывода
    Уникальные числа из исходного массива по возрастанию и символы подчёркивания. Элементы должны быть разделены пробелами. 
    Общее количество элементов должно быть равно n.

    Пример 1
    Ввод
    3
    1 1 2
    Вывод
    1 2 _

    Пример 2
    Ввод
    10
    0 0 1 1 1 2 2 3 3 4
    Вывод
    0 1 2 3 4 _ _ _ _ _
    """
    num_numbers = int(input())
    numbers = list(map(int, input().split()))
    unique_numbers = []
    seen = set()


    for number in numbers:
        if number not in seen:
            seen.add(number)
            unique_numbers.append(number)
    result = unique_numbers + ['_'] * (num_numbers - len(unique_numbers))
    print(' '.join(map(str, result)))

if __name__ == '__main__':
    main()