def main():
    """https://contest.yandex.ru/contest/52598/problems/
    B. Определение индекса для вставки
    Марсоход передаёт на Землю массив с данными о концентрации марсия в почве. Массив отсортирован по возрастанию.
    На Земле учёным нужно определить, есть ли в массиве определённая концентрация марсия. Для этого им нужна программа, 
    которая отыскивает в массиве заданную концентрацию — целевое значение. Если в массиве есть целевое значение, программа должна вернуть индекс первого такого элемента, 
    в котором хранится это значение. Если целевого значения в массиве нет, программа должна вернуть индекс, под которым это значение могло бы располагаться в массиве.
    Таким образом, задача — найти индекс целевого значения в отсортированном массиве или определить индекс, на котором могло бы быть это значение.
    Напишите программу, которая принимает на вход массив и целевое значение, а возвращает индекс массива, где находится или должно находиться целевое значение.

    Формат ввода
    Первая строка — массив целых чисел через пробел.
    Вторая строка — искомое значение.

    Формат вывода
    Целое число: индекс искомого значения в существующем массиве, если оно там есть, или индекс, на котором это значение должно оказаться, если его нет в массиве.

    Пример 1
    Ввод
    1 3 5 6
    5
    Вывод
    2

    Пример 2
    Ввод
    1 5 10 11
    2
    Вывод
    1
    """
    ordered_list = tuple(map(int, input().split()))
    desired_element = int(input())
    
    for pos, item in enumerate(ordered_list):
        if item >= desired_element:
            print(pos)
            return
    print(len(ordered_list))
                

if __name__ == '__main__':
    main()